tests/fixtures/Nestle Invoice 1337721448.txt

NESTLE UK LTD
SALES INVOICE
PAGE1 OF1
ACCOUNTS RECEIVABLE, NESTLE HOUSE, YORK, NORTH YORKSHIRE, YO91 1XY
PLEASE QUOTE YOUR BILL- SHIP-TO NO : INVOICE NO : INVOICE DATE: SALES ORDER NO : ANY ACCOUNT QUERIES TO: OUR BANK IS:
(TAXPOINT)
TO AND INVOICE No. ON ALL 6873866 1337721448 379759426 0800 783 8564 HSBC Bank PLC.
09/12/2025
COMMUNICATIONS BRANCH NO : DELIVERY NOTE NO : 2ND FLOOR,
8113192864 62-76 Park Street,
London SE1 9DZ.
DELIVERY ADDRESS: INVOICE ADDRESS: BILL-TO NO: 6873868
Beanfreaks Ltd Beanfreaks Limited CUSTOMER ORDER NO: 0025703
124 Cowbridge Road East Morgan Quarter DELIVERY NOTE DATE: 12/12/2025 PLEASE MAKE PAYMENT TO:
Cardiff 8 Royal Arcade DATE ORDER TAKEN: 09/12/2025 NESTLÉ UK LTD RECEIVABLES
South Glamorgan Cardiff DESPATCH LOCATION: B501 ACCOUNT No: 21269526
CF11 9DX South Glamorgan
SORTING CODE:40-02-50
CF10 1AE
PAYMENT DUE DATE: 16/01/2026 CURRENCY: GBP
ALL PRICES ARE IN: GBP VAT REG NO: GB315121510 IBAN Number: GB25MIDL40025021269526
BIC: MIDLGB22
REF DESCRIPTION UNIT PRODUCT CODE QUANTITY PRICE % VAT EXTENSION
No. EX VAT EX VAT
10 SOLG Advn Acidophilus Plus 20x120 CAP GB EA 12536248 1 14.97 20.00 14.97
20 SOLG Biotin 1000mcg 42x50 CAP GB EA 12543545 1 4.03 20.00 4.03
30 SOLG Ca Mg w/Boron 23x100 TAB GB EA 12536297 1 5.34 20.00 5.34
40 SOLG Ester-C Plus 500mg 23x100 CAP GB EA 12524084 1 12.66 20.00 12.66
50 SOLG L-Lysine 500mg 25x50 CAP GB EA 12536363 2 4.58 20.00 9.16
60 SOLGAR Magnesium Citrate 60Tab GB EA 12556057 1 6.77 20.00 6.77 IMPORTANT
70 SOLGAR Magnesium Citrate 120Tab GB EA 12556058 1 10.42 20.00 10.42 WHEN MAKING A PAYMENT
PLEASE PROVIDE YOUR BILL
80 SOLG Multiple Fbr Form 20x120 CAP GB EA 12536372 1 8.07 20.00 8.07
TO NUMBER AND THE INVOICE
90 SOLG Potassium Gluconate 23x100 TAB GB EA 12536618 1 4.31 20.00 4.31 NUMBERS YOU ARE PAYING TO
ENABLE US TO ALLOCATE
100 SOLG Psyllium Husk 20x200 CAP GB EA 12536625 1 9.86 20.00 9.86
YOUR PAYMENT PROMPTLY.
110 SOLG Taurine 500mg 36x50 CAP GB EA 12536641 3 4.31 20.00 12.93
120 SOLG Turmeric 36x60 CAP GB EA 12543633 2 11.63 20.00 23.26
130 SOLGAR Vitmain B-Complex 50 50Cap GB EA 12556043 1 6.17 20.00 6.17
140 SOLG Vit D 400IU 25x100 SGL GB EA 12536652 1 4.05 20.00 4.05
150 SOLG Vit K2 100mcg 36x50 CAP GB EA 12543624 1 14.73 20.00 14.73
SUBJECT TO THE TERMS AND CONDITIONS OVERLEAF
TOTAL PACKAGES : 19
VAT Rates Value Excl VAT VAT Invoice Total ALL PRICES SHOWN ARE NET
20% 146.73 29.35 OF ALL BONUS OR DISCOUNT
TOTALS 146.73 29.35 176.08
NO STATEMENTS RENDERED UNLESS REQUESTED
E& OE NESTLÉ UK LTD (REG. NO. 51491) AND NESTLÉ WATERS UK LTD (REG. NO. 2334804), EACH REGISTERED IN ENGLAND & WALES, ZG01E9A09.12.202517:21:26
registered office Haxby Road, York, England, YO31 8TA.. VAT REGISTRATION NO. GB 169 5627 21
Terms & Conditions of Sale - Nestlé UK Ltd, Nestlé Waters UK Ltd, Cereal Partners UK
1. Applicability of Terms & Conditions: These Terms and Conditions of Sale ('Conditions') apply for all products purchased by You from Nestlé UK Ltd, Nestlé Waters UK Ltd and Cereal Partners UK (a partnership between Nestlé UK Ltd and General Mills
North America Affiliates (itself a partnership between General Mills Canada Corp and General Mills Products Corp)) for which Nestlé UK Ltd acts as agent ('Products').These Conditions apply in place of and prevail over any terms or conditions contained or
referred to in any communication from You or implied by custom or practice. Other purported terms or conditions are expressly rejected.
2. Orders: By placing an order with us, by whatever means, You acknowledge or are deemed to acknowledge that You are fully aware of these Conditions and are offering to contract on the basis of these Conditions. All orders only bind us when we accept
them and are accepted subject to availability of stocks. Our price list is not an offer and any current price list replaces all previous price lists. You may only require delivery to one place at one time. The minimum order quantity for each of the Products is
specified in the relevant product price list.
3. Prices: Except where otherwise agreed with us in writing, Products will be invoiced in Sterling at the price current on the date of despatch as recorded on our computer system. Prices are quoted exclusive of VAT(where applicable). Prices and any
additional commercial terms are subject to change without notice.
4. Payment, Recovery of Sums due, Interest and Set-Off:Payment is due on the 16th of the month following the month of invoice unless otherwise stated on the relevant invoice (' Due Date'). Time is of the essence. Payment will be collected by Direct Debit on
the Due Date. Where agreed in writing you may pay us by BACS payment to a bank account authorised by us with cleared funds on or before the Due Date. Payment due to us may include deductions for agreed activity with adequate supporting
documentation. Should You fail to pay any Nestlé invoice on time or otherwise levy any deduction, withholding or set -off which has not been previously agreed to by Nestlé against a Nestlé account ('Deduction'), all monies owed by You to us will become
payable on demand and will entitle us to: (a) charge interest on overdue accounts and Deductions at the statutory rate in the Late Payment of Commercial Debts (Interest ) Act 1998 (b) suspend delivery or any credit facilities (c) exercise our right to
repossess the Products in accordance with clause 6 and (d) levy administration charges. Our charges are £15 for any dishonoured payment; £25 if, following action, we re-instate your account to credit; and any charges and legal and other costs that we
incur in pursuing or enforcing any legal or debt recovery action.
5. Delivery, Acceptance of Delivery, Claims and Pallets:We use reasonable endeavours to deliver Products in the time, manner and to the place requested by You but any date quoted by us is an estimate and time shall not be of the essence. When You specify
delivery is to be made in instalment, each instalment shall be deemed to be a separate contract. We shall not be liable for late delivery, non-delivery or variation in quantities delivered. We may reduce, vary or cancel orders if we are unable, through short
age of stocks or for other reasons, to execute them and we may make such alterations to Products and/or packaging as circumstances may demand. You must use reasonable endeavours to accept delivery in accordance with any agreed delivery schedule
and, if we request, to assist with the unloading of any consignment. You must check that the quantity and specifications of Products delivered correspond with your order before You sign any delivery note. The signature by You or your authorised employee
or agent of the delivery note or similar document is conclusive evidence of your inspection and acceptance of the consignment as being for the correct amount and free from damage visible on inspection. No written claim for damage or short delivery is
necessary when recorded on the delivery note. In all other cases, written claims for damage, short delivery or other delivery error must be given to us within 3 working days of delivery. Unless we otherwise agree in writing, You must retain damaged
Products for inspection and collection. Credit facilities are offered at Nestlé's discretion and may be withdrawn at any time. It is your responsibility to work with the pallet provider to ensure that all pooled pallets are returned to the provider.
6. Risk & Title: The Incoterm (ICC Incoterms 2010) applicable to the contract with us is [CIP] and this means that risk in the Products will pass to You when the Products are unloaded at the delivery address unless otherwise agreed between us in writing and
shown on Nestlé's invoice. We will retain title in the Products until we have received in full (in cash or cleared funds) all sums due to us in respect of the Products and all other sums which are or become due to us from you on any account including charges,
accrued interest and legal costs. From delivery until title passes to You, You have the legal obligations to us of Bailee of the Products for us. This means You must take proper care of the Products to prevent any damage or deterioration of them and must
keep the Products free from any charge, lien or other encumbrance. You must store the Products in such a way as to show clearly that they belong to us; and give us such information relating to the Products as we may require from time to time. We reserve
the right to repossess any Products held by You as Bailee for us for any reasonable cause. You irrevocably grant to us such right, licence or waiver as may be required to enable us, our employees and agents to enter the premises where the Products are
situated for that purpose.
7. Warranty: We warrant that as at delivery to You or your agents who are based in the UK or Ireland, our Products comply with the Food Safety Act 1990 and all relevant UK food law in force from time to time.
8. Limitation of Liability: We limit our liability to the maximum extent permitted by law as follows: (i) in respect of all Products supplied by us, our liability shall be limited to Products consumed up to and including the " Best Before" or " Use By" date;
(ii) our liability shall be limited at our option to replacing the whole or part of any Products found to be defective or refunding or crediting the limited. We shall have no liability for any loss or damage suffered by any person: (a) as a consequence of any defect
in any Product caused by abnormal storage conditions. This means the storage conditions need to be fit for purpose in meeting recognised standards of hygiene, housekeeping and pest management. In addition we are not liable if storage temperatures are
not appropriate to the Product (ambient, chilled, frozen) or there is any abnormal treatment or handling or any negligence or other wrongful act on your part or that of your employees or agents; (b) for claims for damage reasonably apparent on inspection at
the time of delivery or for short delivery unless You have complied with the conditions of clause 5; (c) for claims in respect of defects not readily identifiable on proper inspection, unless You notify us in writing within three months of delivery of the
Products to You with full particulars of the complaint supported by reasonable evidence that the Products have not been tampered with nor been incorrectly stored; Any allegedly defective Products must be retained and made available to us for
inspection and collection; (d) for any claim arising on an invoice issued more than three months before the date upon which such claim is received by us; (e) for any loss of profit, loss of sale, loss of goodwill, loss of reputation, loss of customers and any
other similar losses caused by our negligence or other wrongful act on our part or that of our agents or employees; and (f) any failure to perform any of our obligations in the Conditions where such failure is caused by any circumstances beyond our
reasonable control. If a third party notifies you of any claim You must immediately notify us in writing of all information available regarding the nature and extent of any such claim and You must allow us to deal with it. You must take any steps
possible to mitigate any loss or damages suffered, must not admit liability and must take any reasonable steps as we may direct. We will not accept responsibility for any representations or payments made by You to any party in settlement of any such claim
nor will we pay any handling or administration charge which we have not agreed in writing in advance.
9. No Sale or Return: We do not offer our Products on "Sale or Return" and You must sell the Products before any "Use By" or "Best Before" date.
10. GSCOP: The Groceries Supply Code of Practice (' GSCOP' ) as set out in Schedule 1 of The Groceries (Supply Chain Practices) Market Investigation Order 2009, shall apply to the sale of all Products to a Designated Retailer.
11. Intellectual Property Rights: All intellectual property rights in the Products shown in our price lists shall remain at all times the property of Nestlé UK Ltd., its ultimate holding company, any subsidiary of such ultimate holding company and/or any
company wholly or partly owned directly or indirectly by such company. You shall acquire no rights in the Products except as expressly agreed between us in writing. You agree that You or your employees or agents will not alter or remove any trade
mark or label or otherwise interfere with any intellectual property rights in the Products and that the Products will not be sold under or by reference to the trademarks designating them, after the original containers or packs have been opened.
12. Data Protection: We may use information provided by You for all purposes reasonably necessary to properly regulate business dealings between us in relation to these Conditions, including, but not limited to, recording this information or updating our
records, credit referencing and supplying your details to a credit reference agency (which will retain information for their own use) for credit ratings and for tracing purposes in the event of your default. A copy of your personal data held by will be provided
(on payment of a fee). By placing an order with us You consent to our processing your personal data for the purposes stated above.
13. General: By accepting these Conditions, we each agree that the Contracts (Rights of Third Parties) Act 1999 shall not apply to sales under these Conditions. These Conditions shall be governed by and construed according to the laws of England and the
courts of England shall have exclusive jurisdiction.
Nestlé UK Ltd (Reg. No. 51491) and Nestlé Waters UK Ltd (Reg. No. 2334804) are each registered in England & Wales, registered office Haxby Road, York, England, YO31 8TA..